InformationRegisters/СостоянияПравилВизуализацииЦентраЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияПравилВизуализацииЦентраЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПравила</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостоянияПравилВизуализацииЦентраЭДО/Ext/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  Идентификатор - Строка
// 
// Возвращаемое значение:
//  Булево
Функция ЕстьПравило(Идентификатор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СостоянияПравилВизуализацииЦентраЭДО.ИдентификаторПравила
		|ИЗ
		|	РегистрСведений.СостоянияПравилВизуализацииЦентраЭДО КАК СостоянияПравилВизуализацииЦентраЭДО
		|ГДЕ
		|	СостоянияПравилВизуализацииЦентраЭДО.ИдентификаторПравила = &ИдентификаторПравила";
	
	Запрос.УстановитьПараметр("ИдентификаторПравила", Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

// Параметры:
//  ИдентификаторПравила - Строка
//  ДатаОбновления - Дата
Процедура Записать(ИдентификаторПравила, ДатаОбновления) Экспорт
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторПравила.Установить(ИдентификаторПравила);
	ЗаписьНабора = НаборЗаписей.Добавить();
	ЗаписьНабора.ИдентификаторПравила = ИдентификаторПравила;
	ЗаписьНабора.ДатаОбновления = ДатаОбновления;
	НаборЗаписей.Записать();
КонецПроцедуры

#КонецОбласти

#КонецЕсли
